In [ ]:
# pandas operations

In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    'col1' : [1,2,3,4],
    'col2' : [444, 555, 666, 444],
    'col3' : ['abc', 'def', 'ghi', 'xyz']
})

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz